---
type: RenderingImageExposureSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# RenderingImageExposureSettings

`Autodesk.Revit.DB.RenderingImageExposureSettings` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ExposureValue | 2013 | `public double ExposureValue { get ; set ; }` |
| Property | Highlights | 2013 | `public double Highlights { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Saturation | 2013 | `public double Saturation { get ; set ; }` |
| Property | Shadows | 2013 | `public double Shadows { get ; set ; }` |
| Property | WhitePoint | 2013 | `public double WhitePoint { get ; set ; }` |